export const historyData = [
  {
    year: "2024",
    events: [
      {
        date: ["2024.08.15"],
        title: "제5회 한국창의코딩대회",
        location: "춘천 호반체육관",
      },
      {
        date: ["2024.02.16", "2024.02.18"],
        title: "제12회 한국로보컵오픈",
        location: "평창 알펜시아리조트",
      },
    ],
  },
  {
    year: "2023",
    events: [
      {
        date: ["2023.12.05", "2023.12.09"],
        title: "로보컵 아시아퍼시픽 평창",
        location: "평창 알펜시아리조트",
      },
      {
        date: ["2023.07.30"],
        title: "제4회 한국창의코딩대회",
        location: "춘천 호반체육관",
      },
      {
        date: ["2023.02.19", "2023.02.21"],
        title: "제11회 한국로보컵오픈",
        location: "평창 용평리조트",
      },
    ],
  },
  {
    year: "2022",
    events: [
      {
        date: ["2022.08.17"],
        title: "제3회 한국창의코딩대회",
        location: "구리시체육관",
      },
      {
        date: ["2022.06.10", "2022.06.12"],
        title: "제10회 한국로보컵오픈",
        location: "평창 용평리조트",
      },
    ],
  },
  {
    year: "2021",
    events: [
      {
        date: ["2021.12.17", "2021.12.19"],
        title: "제9회 한국로보컵오픈",
        location: "평창 용평리조트",
      },
    ],
  },
  {
    year: "2020",
    events: [
      {
        date: ["2020.08.14", "2020.08.15"],
        title: "제9회 한국로보컵오픈",
        location: "온라인",
      },
    ],
  },
  {
    year: "2019",
    events: [
      {
        date: ["2019.02.14", "2019.02.16"],
        title: "제8회 한국로보컵오픈",
        location: "원주 오크밸리",
      },
    ],
  },
  {
    year: "2018",
    events: [
      {
        date: ["2018.08.15"],
        title: "제2회 한국창의코딩대회",
        location: "대전 한밭대학교",
      },
      {
        date: ["2018.02.08", "2018.02.09"],
        title: "제7회 한국로보컵오픈",
        location: "서울 국민대학교",
      },
    ],
  },
  {
    year: "2017",
    events: [
      {
        date: ["2017.08.19"],
        title: "제1회 한국창의코딩대회",
        location: "대전 한밭대학교",
      },
      {
        date: ["2017.02.17", "2017.02.18"],
        title: "제6회 한국로보컵오픈",
        location: "대구 엑스코",
      },
    ],
  },
] as const;
